// INSERT-запросы
// Для выполнения INSERT-запросов можно использовать функцию Exec() (англ. execute — «исполнять») из пакета database/sql. На вход она принимает SQL-запрос в виде строки и параметры запроса. Возвращает объект типа sql.Result и ошибку. Функция Exec() выполняет запрос, но не возвращает строки из БД. Объект sql.Result позволяет узнать, сколько строк было добавлено, удалено или изменено, и получить последний добавленный идентификатор при вставке новых строк.
// Возможность получить последний идентификатор поддерживают не все SQL-драйвера. Это может быть связано с особенностями БД. Например, такой возможности нет в драйвере pq для PostgreSQL. Почему это так — тема для отдельного урока. В рамках курса мы работаем с драйвером sqlite, в нём эта функция поддерживается.
// Ранее в этом уроке вы узнали про параметры запроса. Их можно использовать не только в условиях SELECT-запросов, но и с другими запросами тоже. Например, для INSERT-запросов через параметры можно подставить значения, которые нужно добавить в таблицу.
// Допустим, в таблицу products нужно добавить новый продукт с названием «Облачное хранилище» и ценой 300. Ниже дан код, который позволит это сделать. Изучите его и комментарии, которые идут после:

package main

import (
	"database/sql"
	"fmt"

	_ "modernc.org/sqlite"
)

func main() {
	db, err := sql.Open("sqlite", "demo.db")
	if err != nil {
		fmt.Println(err)
		return
	}
	defer db.Close()

	product := "Облачное хранилище"
	price := 300
	// название продукта и цена передаются через параметры
	res, err := db.Exec("INSERT INTO products (product, price) VALUES (:product, :price)",
		sql.Named("product", product),
		sql.Named("price", price))
	if err != nil {
		fmt.Println(err)
		return
	}

	fmt.Println(res.LastInsertId())
	fmt.Println(res.RowsAffected())
}
